#define _CRT_SECURE_NO_WARNINGS 1


#include<stdio.h>
#include<stdlib.h>
#include<string.h>


//类型不同  决定了如何开辟空间大小
//int main()
//{
//	int a =10;
//	float b =10.0;
//	printf("%p %p\n",&a,&b);
//	return 0;
//}
//int main()
//{
//	//unsigned char 无符号的字符 存的是ASCII码值 无符号数的范围0-255；有符号数的范围 -128----127之间
//
//	return 0;
//}
//void test()//你如果想说无参数里面填上void
//{
//	printf("hello word\n");
//}
//int main()
//{
//	test();//C语言说你传参可以也可以不传参  
//	return 0;
//}

//int main()
//{
//	int a =20;
//	int b=-10;
//	return 0;
////}
//int main()
//{
//	int i =-20;
//	unsigned int j=10;
//	printf("%d\n",i+j);
//	//按照补码的形式进行运算  最后格式化成为有符号的整数 
//	return 0;
//}
//int -20的源码
//10000000000000000000000000010100   ----原码
//11111111111111111111111111101011   ----反码
//11111111111111111111111111111100   ----补码
//00000000000000000000000000001010   -----正数的原码 反码 补码相同
//11111111111111111111111111110110   ------ int -20和int 10补码相加的结果
//11111111111111111111111111110101   ------int -20和int 10反码
//10000000000000000000000000001010    ----原码结果是-10


//int main()
//{
//	unsigned int i;
//	for(i=9;i>=0;i--)
//	{
//		printf("%u\n",i);
//	}
//	return 0;
//}
//计算   无符号的9原码 反码 补码相同 
//则9的原码 00000000000000000000000000001001
//则9的反码 00000000000000000000000000001001
//因为无符号的9 所以 最后等于0-1 等于-1 但是-1是是有符号的 但是定义的无符号的 所以是一个特别大的数


int main()
{
	char a[1000];
	int i ;
	for(i=0;i<1000;i++)
	{
		a[i]=-1-i;
	}
	printf("%d",strlen(a));
	return 0;
}